demo/artillery/new_patterns/long_equal.yml
config:
  target: 'http://35.234.80.55'
  phases:
    - duration: 1800
      name: "Warm up the application"
      arrivalRate: 6
    - duration: 1800
      name: "Start pattern"
      arrivalRate: 6
    - duration: 300
      arrivalRate: 6
      rampTo: 20
    - duration: 2400
      arrivalRate: 20
    - duration: 300
      arrivalRate: 20
      rampTo: 6
    - duration: 2400
      arrivalRate: 6
    - duration: 300
      arrivalRate: 6
      rampTo: 20
    - duration: 2400
      arrivalRate: 20
    - duration: 300
      arrivalRate: 20
      rampTo: 6
    - duration: 2400
      arrivalRate: 6
scenarios:
  - flow:
    - get:
        url: "/"